/*unsigned int a= 0x1234;
* 0000 0000 0000 0000 0001 0010 0011 0100
*  00 00 12 34
unsigned char b = *(unsigned char *)&a;
* 0000 0000 0000 0000 0001 0010 0011 0100
在32位大端模式处理器上变量b等于（ ）*/

//#include <stdio.h>
//int main()
//{
//	unsigned int a = 0x1234;
//	unsigned char b = *(unsigned char*)&a;
//	//大端存储，低  00 00 12 34(低字节) 高 ，给的是低地址0x00，高位在低地址，低位在高地址
//	//所以b=0x00
//
//	//小端存储，低 34 12 00 00(高字节) 高,给的是低地址0x34，高位在高地址，低位在低地址
//	//所以b=0x34
//	printf("%x\n", b);
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	unsigned char a = 200;
//	// 1100 1000
//	unsigned char b = 100;
//	// 0110 0100
//	unsigned char c = 0;
//	// 0000 0000
//	c = a + b;
//	// 1100 1000
//	// 0110 0100
//	// 1 0010 1100,截断高位，只保留低位,0010 1100，所以c=44
//	printf(" % d % d", a + b, c);
//	//1 0011 1100 %d打印有符号整数，发生整型提升后为0000 0000 0000 0000 0000 0000 0001 0011 1100
//	//也就是300
//	return 0;
//}

//#include <stdio.h>
//int main()
//{
//	char a[1000] = { 0 };
//	//VS2019中，编译器默认char类型是有符号的
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//		//-1 -2 -3
//	}
//	printf("%d", strlen(a));
//	//strlen函数计算字符串长度，遇到\0结束，所以输出为255
//	//上面的补码发生截断，所以a[0] = 1111 1111，a[1] = 1111 1110，a[2] = 1111 1101
//	//到-256时，a[255] = 0000 0000，所以输出为255
//	return 0;
//}

/*猜名次
5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：

A选手说：B第二，我第三；

B选手说：我第二，E第四；

C选手说：我第一，D第二；

D选手说：C最后，我第三；

E选手说：我第四，A第一；

比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。*/
//#include <stdio.h>
//int main()
//{
//	int a, b, c, d, e;
//	for (a = 1; a <= 5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if (((b == 2) + (a == 3) == 1) &&
//							((b == 2) + (e == 4) == 1) &&
//							((c == 1) + (d == 2) == 1) &&
//							((c == 5) + (d == 3) == 1) &&
//							((e == 4) + (a == 1) == 1))
//						{
//							if (a * b * c * d * e == 120)
//							{
//								printf("a=%d b=%d c=%d d=%d e=%d\n", a, b, c, d, e);
//							}
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}

/*日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。以下为4个嫌疑犯的供词:
A说：不是我。
B说：是C。
C说：是D。
D说：C在胡说

已知3个人说了真话，1个人说的是假话。现在请根据这些信息，写一个程序来确定到底谁是凶手。*/
//#include <stdio.h>
//int main()
//{
//	char killer = 0;
//	for (killer = 'A'; killer <= 'D'; killer++)
//	{
//		if (((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D')) == 3)
//		{
//			printf("killer = %c\n", killer);
//		}
//	}
//	return 0;
//}

//在屏幕上打印杨辉三角。
#include<stdio.h>
int main()
{
	int arr[10][10] = { 0 };
	int i = 0;
	int j = 0;
	for (i = 0; i < 10; i++)
	{
		arr[i][0] = 1;
		arr[i][i] = 1;
	}
	for (i = 2; i < 10; i++)
	{
		for (j = 1; j < i; j++)
		{
			arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
		}
	}
	for (i = 0; i < 10; i++)
	{
		for (j = 0; j <= i; j++)
		{
			printf("%d ", arr[i][j]);
		}
		printf("\n");
	}
	return 0;
}